export const UslugiList = [
  {
    id: 'elevator-maintenance',
    imgId: ['uslugi-slider-1.png', 'uslugi-slider-2.png'],
    imgStartPage: 'our-services_elevator.png',
    title: 'Техническое обслуживание лифтов',
    desc: 'Наши сотрудники обеспечат надлежащее состояние лифтовой шахты и подъемного оборудования, а проведение обслуживания ваших лифтов в соответствии со сроками регламента и постоянный контроль всех составляющих оборудования обеспечат бесперебойную работу и продление срока службы лифтов.',
    path: '/uslugi/elevator-maintenance'
  },
  {
    id: 'escalator-maintenance',
    imgId: ['uslugi-slider-1.png', 'uslugi-slider-2.png'],
    imgStartPage: 'our-services_escalator.png',
    title: 'Техническое обслуживание эскалаторов',
    desc: 'Регулярная проверка нашими специалистами состояния всех звеньев, элементов, внешних и внутренних механизмов эскалаторов,  качественное и своевременное техническое обслуживание нашими профессионалами - вот что нужно для надежной и безопасной работы ваших эскалаторов.',
    path: '/uslugi/escalator-maintenance'
  },
  {
    id: 'lifting-service',
    imgId: ['uslugi-slider-1.png', 'uslugi-slider-2.png'],
    imgStartPage: 'our-services_platform.png',
    title: 'Техническое обслуживание платформ подъемных',
    desc: 'пыт и профессионализм нашего персонала и строгое выполнение всех требований эксплуатационной документации завода-изготовителя позволяют нам обеспечивать высокую работоспособность любых видов и типов подъемных платформ (грузовых, гидравлических, инвалидных, столовых и т.п.)',
    path: '/uslugi/lifting-service'
  },
  {
    id: 'elevator-equipment',
    imgId: ['uslugi-slider-1.png', 'uslugi-slider-2.png'],
    imgStartPage: 'our-services_equipment.png',
    title: 'Наладка электронного оборудования подъемных устройств',
    desc: 'Для корректной работы подъемных сооружений, инженеры и техники службы наладки проведут необходимое считывание, обработку, загрузку и установку данных, в случае необходимости, подберут необходимое электронное оборудование, произведут его замену, настроят, выставят нужные параметры работы лифтов, эскалаторов, подъёмных платформ, проверят точность работы внесенных изменений и оборудования в целом',
    path: '/uslugi/elevator-equipment'
  }
]


export const VacList = [
  {
    id: 'electro',
    title: 'Электромеханик по лифтам',
    text: 'Техническое обслуживание лифтового оборудования отечественного и импортного производства;',
    path: '/vacancies/electro',
    desc: '<h6>Обязанности</h6><ul><li>Техническое обслуживание лифтового оборудования отечественного и импортного производства</li><li>Поиск и устранение технической неисправности</li><li>Текущий ремонт лифтового оборудования</li><li>Ведение документации на объекте</li></ul>' +
      '<h6>Требования</h6><ul><li>Техническое образование</li><li>Обязателен опыт работы в аналогичной должности от 3 лет</li><li>Наличие группы по электробезопасности (будет преимуществом)</li><li>Наличие свидетельства о квалификации ЦОК (будет преимуществом)</li><li>Наличие прав категории В (будет преимуществом)</li></ul>' +
      '<h6>Условия</h6><ul><li>Возможные графики: 5/2, 2/2 и 1/3 (зависит от объекта)</li><li>Возможность дополнительного заработка за счет доп. работ по ремонту лифтового оборудования (по желанию)</li><li>Предоставляется спецодежда/обувь, СИЗ, инструмент</li><li>Возможность обучения, повышения квалификации с получением соответствующего удостоверения</li><li>Официальное оформление по ТК РФ, оплата отпусков и больничных листов согласно ТК РФ</li><li>Уровень дохода зависит от квалификации, графика работы и объекта</li><li>Работа на объектах города Москвы</li></ul>'
  }
]
