export const UslugiList = [
  {
    id: 'elevator-maintenance',
    imgId: ['tehl_1.png', 'tehl_2.png', 'tehl_3.png'],
    imgStartPage: 'our-services_elevator.png',
    title: 'Техническое обслуживание лифтов',
    desc: 'Наши сотрудники обеспечат надлежащее состояние лифтовой шахты и подъемного оборудования, а проведение обслуживания ваших лифтов в соответствии со сроками регламента и постоянный контроль всех составляющих оборудования обеспечат бесперебойную работу и продление срока службы лифтов.',
    path: '/uslugi/elevator-maintenance'
  },
  {
    id: 'escalator-maintenance',
    imgId: ['tehe_1.png', 'tehe_2.png', 'tehe_3.png'],
    imgStartPage: 'our-services_escalator.png',
    title: 'Техническое обслуживание эскалаторов',
    desc: 'Регулярная проверка нашими специалистами состояния всех звеньев, элементов, внешних и внутренних механизмов эскалаторов,  качественное и своевременное техническое обслуживание нашими профессионалами - вот что нужно для надежной и безопасной работы ваших эскалаторов.',
    path: '/uslugi/escalator-maintenance'
  },
  {
    id: 'lifting-service',
    imgId: ['tehp_1.png', 'tehp_2.png', 'tehp_3.png'],
    imgStartPage: 'our-services_platform.png',
    title: 'Техническое обслуживание платформ подъемных',
    desc: 'пыт и профессионализм нашего персонала и строгое выполнение всех требований эксплуатационной документации завода-изготовителя позволяют нам обеспечивать высокую работоспособность любых видов и типов подъемных платформ (грузовых, гидравлических, инвалидных, столовых и т.п.)',
    path: '/uslugi/lifting-service'
  },
  {
    id: 'operation-lifting-equipment',
    imgId: ['expo_1.png', 'expo_2.png', 'expo_3.png'],
    imgStartPage: '',
    title: 'Эксплуатация подъемного оборудования',
    desc: 'По желанию заказчика мы организуем эксплуатацию подъемного оборудования квалифицированными работниками (диспетчерами, операторами, лифтерами), обеспечим круглосуточный мониторинг работы оборудования, состояния работоспособности в ходе эксплуатации, вызов аварийно-ремонтной бригады для устранения неисправности, контроль сроков проведения обслуживания.',
    path: '/uslugi/operation-lifting-equipment'
  },
  {
    id: 'diagnostics-lifting-equipment',
    imgId: ['dpo_1.png', 'dpo_2.png', 'dpo_3.png'],
    imgStartPage: '',
    title: 'Диагностика подъемного оборудования',
    desc: 'Уже много лет мы осуществляем осмотр, диагностику элементов и узлов, проверку работы подъемного оборудования во всех режимах, проверку всех устройств безопасности, оценку состояния, поиск неисправностей, выявление процента износа деталей и механизмов, выдачу актов по результатам обследования на объектах обслуживания.',
    path: '/uslugi/diagnostics-lifting-equipment'
  },
  {
    id: 'search-and-provision',
    imgId: ['pozc_1.png', 'pozc_2.png', 'pozc_3.png'],
    imgStartPage: '',
    title: 'Поиск и обеспечение запасными частями',
    desc: 'Поставка расходных материалов, запчастей, оборудования, комплектующих и т.п. для отечественных и зарубежных лифтов, эскалаторов, платформ и другого подъемного оборудования в настоящее непростое время производится нашими специалистами с индивидуальным подходом к каждому заказу, в зависимости от объема заказа, источников наличия, имеющейся логистики и требований к срокам поставки.',
    path: '/uslugi/search-and-provision'
  },
  {
    id: 'repair-of-components-and-mechanisms-lifting-equipment',
    imgId: ['rumpo_1.png', 'rumpo_2.png', 'rumpo_3.png'],
    imgStartPage: '',
    title: 'Ремонт узлов и механизмов подъемного оборудования',
    desc: 'Ремонт любой сложности – от замены расходных материалов, потерявших эксплуатационные свойства (вкладыши, подшипники, датчики, блоки, контроллеры, и т.п.) до сложных ремонтов узлов и механизмов подъемного оборудования (приводы, канаты, отводные блоки, лебедки, устройства) – это важная составляющая нашей работы, от которой зависит дальнейшее беспроблемное обслуживание подъемного оборудования и безопасная эксплуатация.',
    path: '/uslugi/repair-of-components-and-mechanisms-lifting-equipment'
  },
  {
    id: 'adjustment-of-electronic',
    imgId: ['neopu_1.png', 'neopu_2.png', 'neopu_3.png'],
    imgStartPage: '',
    title: 'Наладка электронного оборудования подъемных устройств',
    desc: 'Для корректной работы подъемных сооружений, инженеры и техники службы наладки проведут необходимое считывание, обработку, загрузку и установку данных, в случае необходимости, подберут необходимое электронное оборудование, произведут его замену, настроят, выставят нужные параметры работы лифтов, эскалаторов, подъёмных платформ, проверят точность работы внесенных изменений и оборудования в целом.',
    path: '/uslugi/adjustment-of-electronic'
  },
  {
    id: 'installation-of-communications',
    imgId: ['msss_1.png', 'msss_2.png', 'msss_3.png'],
    imgStartPage: '',
    title: 'Монтаж связи собственной службой',
    desc: 'Монтеры и наладчики нашей службы связи обеспечат качественный монтаж проводной и беспроводной системы оборудования связи, систем видеонаблюдения, доступа, а также наладку систем с выводом на любую точку контроля под Ваше задание для круглосуточной бесперебойной связи оборудования с системой мониторинга для комфортной и безопасной эксплуатации подъемных сооружений.',
    path: '/uslugi/installation-of-communications'
  },
  {
    id: 'dispatching-monitoring-of-elevators',
    imgId: ['dkrl_1.png', 'dkrl_2.png', 'dkrl_3.png'],
    imgStartPage: '',
    title: 'Диспетчеризация, мониторинг лифтов, эскалаторов',
    desc: 'Объекты нашего контроля любой сложности, имеющие системы технических средств для дистанционного контроля за работой объекта и работой устройств безопасности сооружений, а также для обеспечения двусторонней переговорной связи между объектом и диспетчерским (операторским) пунктом, будут обеспечены круглосуточным мониторингом за работой контролируемых устройств и сооружений, возможность связи и дистанционного отключения оборудования обеспечит необходимую безопасность эксплуатации.',
    path: '/uslugi/dispatching-monitoring-of-elevators'
  },
  {
    id: 'emergency-service',
    imgId: ['kato_1.png', 'kato_2.png', 'kato_3.png'],
    imgStartPage: '',
    title: 'Круглосуточное аварийно-техническое обслуживание подъемного оборудования',
    desc: 'Подъемное оборудование является технически сложным и нуждается в ежедневном круглосуточном аварийно-техническом обслуживании нашей диспетчерской, на которую выведена связь с обслуживаемыми объектами, и нашей аварийной службой, электромеханики которой, выезжают по заявкам на объекты.',
    path: '/uslugi/emergency-service'
  },
  {
    id: 'kone-winch-repair',
    imgId: ['rlk_1.png', 'rlk_2.png', 'rlk_3.png'],
    imgStartPage: '',
    title: 'Ремонт лебедок KONE',
    desc: 'Наши специалисты помогут быстро определить проблему, предложить оптимальное решение по ремонту лебедок KONE. <br>Наши группы по ремонту:<br><a href="https://t.me/KONE_ELEVATOR_REMONT" target="_blank">https://t.me/KONE_ELEVATOR_REMONT</a> <br><a href="https://vk.com/koneremont" target="_blank">https://vk.com/koneremont</a>',
    path: '/uslugi/kone-winch-repair'
  },
  {
    id: 'supply-and-installation-of-elevators',
    imgId: ['ppim_1.png', 'ppim_2.png', 'ppim_3.png'],
    imgStartPage: '',
    title: 'Проектирование, поставка и монтаж лифтов, эскалаторов, платформ подъемных',
    desc: 'Партнеры из нашей группы компаний произведут проектирование, поставку и монтаж подъемного оборудования, учитывая все ваши пожелания.<br><a href="https://www.modtfil.ru/" target="_blank">Ссылка на сайт партнера</a>',
    path: '/uslugi/supply-and-installation-of-elevators'
  },
  {
    id: 'elevator-design-and-interior',
    imgId: ['diil_1.png', 'diil_2.png', 'diil_3.png'],
    imgStartPage: '',
    title: 'Дизайн и интерьер лифтов',
    desc: 'Партнеры из нашей группы компаний разработают стильный дизайн ваших лифтов, выполнят отделку кабин с учетом Ваших пожеланий. <br><a href="https://www.modtfil.ru/" target="_blank">Ссылка на сайт партнера</a>',
    path: '/uslugi/elevator-design-and-interior'
  },
  {
    id: 'modernization-of-elevators',
    imgId: ['kriml_1.png', 'kriml_2.png', 'kriml_3.png'],
    imgStartPage: '',
    title: 'Капитальные ремонты, модернизация лифтов:',
    desc: 'Наши сотрудники проведут капитальный ремонт с заменой всех необходимых узлов и деталей, а также при необходимости – модернизацию, усовершенствовав и преобразив лифт с оптимизацией эксплуатационных характеристик, соответствующих требованиям Технического регламента Таможенного союза «Безопасность лифтов».',
    path: '/uslugi/modernization-of-elevators'
  }
]


export const VacList = [
  {
    id: 'electro',
    title: 'Электромеханик по лифтам',
    text: 'Техническое обслуживание лифтового оборудования отечественного и импортного производства;',
    path: '/vacancies/electro',
    desc: '<h6>Обязанности</h6><ul><li>Техническое обслуживание лифтового оборудования отечественного и импортного производства</li><li>Поиск и устранение технической неисправности</li><li>Текущий ремонт лифтового оборудования</li><li>Ведение документации на объекте</li></ul>' +
      '<h6>Требования</h6><ul><li>Техническое образование</li><li>Обязателен опыт работы в аналогичной должности от 3 лет</li><li>Наличие группы по электробезопасности (будет преимуществом)</li><li>Наличие свидетельства о квалификации ЦОК (будет преимуществом)</li><li>Наличие прав категории В (будет преимуществом)</li></ul>' +
      '<h6>Условия</h6><ul><li>Возможные графики: 5/2, 2/2 и 1/3 (зависит от объекта)</li><li>Возможность дополнительного заработка за счет доп. работ по ремонту лифтового оборудования (по желанию)</li><li>Предоставляется спецодежда/обувь, СИЗ, инструмент</li><li>Возможность обучения, повышения квалификации с получением соответствующего удостоверения</li><li>Официальное оформление по ТК РФ, оплата отпусков и больничных листов согласно ТК РФ</li><li>Уровень дохода зависит от квалификации, графика работы и объекта</li><li>Работа на объектах города Москвы</li></ul>'
  }
]
