<script lang="ts" setup>
  import { ref } from "@vue/reactivity";

  const modal = ref(false)
  const modalPolitika = ref(false)
  const footer = [
    {
      title: 'Компания',
      links: [
        {
          text: 'О нас',
          href: '/about'
        },
        {
          text: 'Вакансии',
          href: '/vacancies'
        }
      ]
    },
    {
      title: 'Нормативные документы',
      click() {
        return modal.value = true
      },

      links: [
        {
          text: 'Политика конфиденциальности',
          click() {
            return modalPolitika.value = true
          },
        }
      ]
    },
    {
      title: 'Контакты',
      links: [
        {
          text: 'г. Москва, Сиреневый бульвар, дом 44, корпус 1',
          href: 'https://yandex.ru/maps/-/CHGWbGzp'
        },
        {
          text: 'тел. +7 968 328-66-70',
          phone: 'tel:+7968 328 66 70'
        },
        {
          text: 'тел. +7 (495) 665-67-89',
          phone: 'tel:+74956656789'
        },
        {
          text: 'тел. +7 (925) 600-36-45',
          phone: 'tel:+79256003645'
        },
        {
          text: 'modtfil.service@gmail.com <br> info.liftdom@gmail.com'
        }
      ]
    }
  ]
  const docs = [
      'Профстандарт_Электромеханик_по_эксплуатации,_техническому_обслуживанию.rtf',
      'Федеральный_закон_от_03_07_2016_N_238_ФЗ_О_независимой_оценке_квалификации.rtf',
      'Постановление_Правительства_РФ_от_16_11_2016_N_1204_Об_утверждении.rtf',
      'Федеральное_тарифное_соглашение_в_лифтовой_отрасли_и_сфере_в_вертикального.rtf',
      'Профстандарт_Диспетчер_аварийно_диспетчерской_службы.rtf',
      'Профстандарт_Специалист_по_оборудованию_диспетчерского_контроля.rtf',
      'Профстандарт_Наладчик_электронного_оборудования_лифтов,_подъемных.rtf',
      'Профстандарт_Специалист_по_эксплуатации_лифтового_оборудования.rtf',
      'Профстандарт_Специалист_по_эксплуатации_эскалаторов,_пассажирских.rtf',
      'Профстандарт_Электромеханик_по_лифтам.rtf',
      'Профстандарт_Электромеханик_по_эксплуатации_и_обслуживанию_подъемных.rtf',
      'Профстандарт_Лифтер_оператор_по_обслуживанию_лифтов_и_платформ_подъемных.rtf',
      'Жилищный_кодекс_Российской_Федерации_от_29_12_2004_N_188_ФЗ.rtf',
      'ГОСТ_5746_2015_ISO_4190_1_2010_Межгосударственный_стандар.rtf',
      'ГОСТ_8823_2018_Межгосударственный_стандарт_Лифты_грузовые_.rtf',
      'ГОСТ_33605_2021_Межгосударственный_стандарт_Лифты_Термины.rtf',
      'ГОСТ_33652_2019_EN_81_70_2018_Межгосударственный_стандарт.rtf',
      'ГОСТ_33653_2019_EN_81_71_2018_Межгосударственный_стандарт.rtf',
      'ГОСТ_33984_1_2016_EN_81_20_2014_Межгосударственный_станда.rtf',
      'ГОСТ_33984_2_2016_EN_81_20_2014_Межгосударственный_станда.rtf',
      'ГОСТ_33984_3_2017_EN_81_50_2014_Межгосударственный_станда.rtf',
      'ГОСТ_33984_4_2017_EN_81_50_2014_Межгосударственный_станда.rtf',
      'ГОСТ_34583_2019_Межгосударственный_стандарт_Лифты_Правила.rtf',
      'ГОСТ_34682_1_2020_EN_81_40_2008_Межгосударственный_станда.rtf',
      'ГОСТ_34682_2_2020_EN_81_41_2010_Межгосударственный_станда.rtf',
      'ГОСТ_Р_53296_2009_Установка_лифтов_для_пожарных_в_зданиях_и.rtf',
      'ГОСТ_Р_53387_2009_ИСО_ТС_14798_2006_Национальный_стандарт.rtf',
      'ГОСТ_Р_53780_2010_ЕН_81_1_1998,_ЕН_81_2_1998_Национальный.rtf',
      'ГОСТ_Р_53782_2010_Национальный_стандарт_Российской_Федераци.rtf',
      'ГОСТ_Р_55964_2022_Национальный_стандарт_Российской_Федераци.rtf',
      'ГОСТ_Р_55965_2014_Национальный_стандарт_Российской_Федераци.rtf',
      'ГОСТ_Р_55966_2014_CEN_TS_81_76_2011_Национальный_стандарт.rtf',
      'ГОСТ_Р_56943_2016_Национальный_стандарт_Российской_Федераци.rtf',
      'ГОСТ_1_4_2020_Межгосударственный_стандарт_Межгосударственн.rtf',
      'ПП_РФ_от_24_06_2017_N_743_Об_организации_безопасного_использования.rtf',
      'ТР_ТС_0112011_Технический_регламент_Таможенного_союза_0112011_Безопасность.rtf',
      'ГОСТ_34305_2017_EN_81_72_2015_Межгосударственный_стандарт.rtf',
      'ГОСТ_34303_2017_EN_13015_2001_A1_2008_Межгосударственный.rtf',
      'ГОСТ_34489_2018_Межгосударственный_стандарт_Эскалаторы_и_п.rtf',
      'ГОСТ_34581_2019_EN_81_21_2018_Межгосударственный_стандарт.rtf',
      'ГОСТ_33966_1_2016_EN_115_1_2008_A1_2010_Межгосударственный_стандарт.rtf',
      'ГОСТ_34582_2019_Межгосударственный_стандарт_Лифты_Правила_и_методы.rtf'
  ]
</script>

<template>
  <div id="contact" ref="contact" class="footer">
    <div class="main-wrapper">
      <div class="footer-wrapper">
        <div v-for="item in footer" class="footer-item">
          <h6 :class="{'pointer': item.click}" @click="item.click ? item.click() : () => ({})">{{ item.title }}</h6>
          <component
              :is="link.click || link.click ? 'span' : 'a'"
              v-for="link in item.links"
              :href="link.phone || link.href"
              @click="link.click() || false"
          >
            <span v-html="link.text" />
          </component>
        </div>
      </div>

      <div class="footer-social">
        <SocialIcons class="social-wrapper" />

        <p>
          © {{ new Date().getFullYear() }} Modtfil service. Все права сохранены
        </p>
      </div>
    </div>
  </div>

  <v-dialog
      v-model="modal"
      width="1200px"
      @update:model-value="$emit('updateModal')"
  >
    <div class="modal-wrapper">
      <h3>Нормативные документы</h3>
      <div class="close-icon" @click="modal = false">+</div>

      <div class="modal-docs">
        <div v-for="item in docs" class="modal-docs__items">
          <a :href="`/doc/${item}`" download>{{ item }}</a>
          <Download />
        </div>
      </div>
    </div>
  </v-dialog>

  <v-dialog
      v-model="modalPolitika"
      width="1200px"
      @update:model-value="$emit('updateModal')"
  >
    <div class="modal-wrapper">
      <h3>Политика конфиденциальности интернет-сайта</h3>
      <div class="close-icon" @click="modalPolitika = false">+</div>

     <div>
       <span>г.Москва "15" апреля 2024 года</span> <br><br>
       Настоящая Политика конфиденциальности персональных данных (далее - Политика конфиденциальности) является неотъемлемой частью Публичной оферты, размещенной на сайте в сети Интернет по адресу: www.modtfilservice-liftdom.ru (далее - Сайт). Операторами персональных данных Пользователей Сайта являются ООО «Модтфил-Сервис» (ИНН 5041207966) и ООО «Лифтдом» (ИНН 7719489016).
       Использование сервисов Сайта означает безоговорочное согласие Пользователя с настоящей Политикой и указанными в ней условиями обработки его персональной информации; в случае несогласия с этими условиями Пользователь должен воздержаться от использования сервисов. Пользователь гарантирует, что является совершеннолетним.
       <br><br>
       1. ОБЩИЕ ПОЛОЖЕНИЯ
       <br><br>
       1.1. В рамках настоящей Политики под персональной информацией Пользователя понимаются: <br>
       1.1.1. Персональная информация, которую Пользователь предоставляет о себе самостоятельно в процессе использования Сервисов, включая персональные данные Пользователя (Фамилия, Имя, Отчество, номер телефона, адрес электронной почты, информация в комментарии к обращению и т.д.). Обязательная для предоставления Сервисов информация помечена специальным образом (*). <br>
       1.1.2. Данные, которые автоматически передаются сервисам Сайта в процессе их использования с помощью установленного на устройстве Пользователя программного обеспечения, в том числе IP-адрес, данные файлов cookie, информация о браузере Пользователя (или иной программе, с помощью которой осуществляется доступ к сервисам), технические характеристики оборудования и программного обеспечения, используемых Пользователем, дата и время доступа к сервисам, адреса запрашиваемых страниц и иная подобная информация. <br>
       1.1.3. Настоящая Политика конфиденциальности применяется только к Сайту www.modtfilservice-liftdom.ru. Сайт www.modtfilservice-liftdom.ru не контролирует и не несет ответственности за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на Сайте www.modtfilservice-liftdom.ru. <br><br>

       2. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ <br><br>

       2.1. Сайт собирает и хранит только ту персональную информацию, которая необходима для предоставления сервисов или исполнения соглашений и договоров с Пользователем, за исключением случаев, когда законодательством предусмотрено обязательное хранение персональной информации в течение определенного законом срока.
       В случае получения уведомления от Пользователя об отзыве согласия на обработку персональных данных Сайт прекращает обработку персональных данных Пользователя в срок, не превышающий 10 рабочих дней с момента получения.
       Уведомление об отзыве согласия на обработку персональных данных направляется на адрес электронной почты: modtfil.service@gmail.com или info.liftdom@gmail.com, а также путем письменного обращения по юридическому адресу: 107199, г. Москва, вн. тер. г. муниципальный округ Гольяново, Сиреневый бульвар, дом 44, корпус 1<br>
       2.2. Персональную информацию Пользователя Сайт обрабатывает в целях установления с Пользователем обратной связи, касающихся использования Сайта, оказания услуг, обработку запросов и заявок от Пользователя. Категория субъекта: пользователи сайта. Обрабатываемые данные: фамилия, имя, отчество, номер телефона, адрес электронной почты. Категория данных: общие персональные данные. Способ обработки персональных данных: сбор, запись, обработка, накопление, хранение, уточнение (обновление, изменение), извлечение, использование. Срок обработки: в течение 3 лет с даты проявления последней активности на сайте. Персональные данные уничтожаются путем стирания с серверов оператора персональных данных.<br><br>

       3. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ
       И ЕЕ ПЕРЕДАЧИ ТРЕТЬИМ ЛИЦАМ<br><br>

       3.1. Сайт хранит персональную информацию Пользователей в соответствии с внутренними регламентами конкретных сервисов.<br>
       3.2. В отношении персональной информации Пользователя сохраняется ее конфиденциальность, кроме случаев добровольного предоставления Пользователем информации о себе для общего доступа неограниченному кругу лиц. При использовании отдельных сервисов Пользователь соглашается с тем, что определенная часть его персональной информации становится общедоступной.<br>
       3.3. Сайт вправе передать персональную информацию Пользователя третьим лицам в следующих случаях:<br>
       3.3.1. Пользователь выразил согласие на такие действия.<br>
       3.3.2. Передача необходима для использования Пользователем определенного сервиса либо для исполнения определенного соглашения или договора с Пользователем.<br>
       3.3.4. Передача предусмотрена российским или иным применимым законодательством в рамках установленной законодательством процедуры.<br>
       3.3.5. В случае продажи Сайта к приобретателю переходят все обязательства по соблюдению условий настоящей Политики применительно к полученной им персональной информации.<br>
       3.4. Обработка персональных данных Пользователя осуществляется без ограничения срока следующими способами: сбор, запись, систематизация, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передача (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств. Обработка персональных данных Пользователей осуществляется в соответствии с Федеральным законом от 27.07.2006 N 152-ФЗ "О персональных данных" <1>.<br>
       3.5. При утрате или разглашении персональных данных Администрация Сайта информирует Пользователя об утрате или разглашении персональных данных.<br>
       3.6. Администрация Сайта принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.<br>
       3.7. Администрация Сайта совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.<br><br>

       4. ОБЯЗАТЕЛЬСТВА СТОРОН<br><br>

       4.1. Пользователь обязан:<br>
       4.1.1. Предоставить информацию о персональных данных, необходимую для пользования Сервисами Сайта.<br>
       4.1.2. Обновлять, дополнять предоставленную информацию о персональных данных в случае изменения данной информации.<br>
       4.2. Администрация Сайта обязана:<br>
       4.2.1. Использовать полученную информацию исключительно для целей, указанных в настоящей Политике конфиденциальности.<br>
       4.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением предусмотренных настоящей Политикой конфиденциальности.<br>
       4.2.3. Для обеспечения защиты персональных данных Пользователя при их обработке принять следующие правовые, организационные и технические меры от несанкционированного, неправомерного или случайного доступа к персональным данным, уничтожения, изменения, блокирования, копирования, предоставления, распространения персональных данных, а также от иных неправомерных действий в отношении персональных данных:<br>
       - строгое соблюдение требований нормативных правовых актов о защите персональных данных;<br>
       - ограничение числа работников, которым открыт доступ к указанным данным;<br>
       - использование антивирусов, имеющих сертификаты, с целью предотвращения вирусных атак и сохранности персональных данных.<br>
       4.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки в случае выявления недостоверных персональных данных или неправомерных действий.<br><br>

       5. ОТВЕТСТВЕННОСТЬ СТОРОН<br><br>

       5.1. Администрация Сайта, не исполнившая свои обязательства, несет ответственность за убытки, понесенные Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации.<br>
       5.2. В случае утраты или разглашения конфиденциальной информации Администрация Сайта не несет ответственности, если данная конфиденциальная информация:<br>
       5.2.1. Стала публичным достоянием до ее утраты или разглашения.<br>
       5.2.2. Была получена от третьей стороны до момента ее получения Администрацией Сайта.<br>
       5.2.3. Была разглашена с согласия Пользователя.<br><br>

       6. РАЗРЕШЕНИЕ СПОРОВ<br><br>

       6.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем Сайта и Администрацией Сайта, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).<br><br>
       6.2. Получатель претензии в течение 30 календарных дней со дня получения претензии письменно уведомляет заявителя претензии о результатах рассмотрения претензии.<br>
       6.3. При недостижении соглашения спор может быть передан на рассмотрение в суд в соответствии с действующим законодательством Российской Федерации.<br>
       6.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией Сайта применяется действующее законодательство Российской Федерации.<br><br>
       7. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ<br><br>

       7.1. Администрация Сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.<br>
       7.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте, если иное не предусмотрено новой редакцией Политики конфиденциальности.<br>
       7.3. Все предложения или вопросы по настоящей Политике конфиденциальности следует сообщать на адрес электронной почты modtfil.service@gmail.com или info.liftdom@gmail.com.<br>
       7.4. Действующая Политика конфиденциальности размещена на странице по адресу: www.modtfilservice-liftdom.ru.<br>
       7.5. Настоящая Политика конфиденциальности является неотъемлемой частью Публичной оферты и Соглашения об использовании Сайта, размещенных на странице по адресу: www.modtfilservice-liftdom.ru.<br><br>
       Согласно ч. 5 ст. 18 Федерального закона от 27.07.2006 N 152-ФЗ "О персональных данных" при сборе персональных данных, в том числе посредством информационно-телекоммуникационной сети Интернет, оператор обязан обеспечить запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение персональных данных граждан Российской Федерации с использованием баз данных, находящихся на территории Российской Федерации, за исключением случаев, указанных в п. п. 2, 3, 4, 8 ч. 1 ст. 6 Федерального закона от 27.07.2006 N 152-ФЗ "О персональных данных".
     </div>
    </div>
  </v-dialog>
</template>


<style lang="scss" scoped>
  .footer {
    width: 100%;
    padding: 64px 0;

    h6 {
      color: var(--title-text-color);
      padding-bottom: 16px;
      font-size: 14px;
      font-weight: 500;
    }

    .footer-wrapper {
      display: flex;
      justify-content: space-between;
      padding-bottom: 50px;
    }

    &-item {
      width: 100%;
      max-width: 384px;

      a,
      span {
        display: block;
        width: max-content;
        font-size: 14px;
        padding-bottom: 12px;
        line-height: 20px;
        color: var(--second-text-color);
        text-decoration: none;
        cursor: pointer;
      }
    }

    &-social {
      display: flex;
      justify-content: space-between;
      padding-top: 64px;
      border-top: 1px solid #E5E5E5;

      &__items {
        display: flex;
        justify-content: space-between;
        width: 144px;
      }

      p {
        color: var(--second-text-color);
        font-size: 14px;
      }
    }

    @media (max-width: 991px) {
      &-item {
        max-width: 32%;
        padding-right: 30px;

        a {
          width: auto;
        }

        span {
          width: auto;
        }
      }
    }

    @media (max-width: 540px) {
      &-item {
        max-width: 38%;
        padding-right: 18px;

        &:first-child {
          max-width: 18%;
        }
      }
    }

    @media (max-width: 460px) {
      padding: 32px 0;

      .footer-wrapper {
        flex-direction: column;
      }

      &-item {
        max-width: 100%;

        a {
          width: max-content;
        }

        span {
          width: max-content;
        }
      }

      .footer-social {
        padding-top: 20px;
        flex-direction: column-reverse;
        align-items: center;
        gap: 20px;
      }
    }

      @media (max-width: 460px) {
          &-item {
              span {

              }
          }
      }
  }

  .modal-docs {
    display: flex;
    justify-content: space-between;
    align-items: center;
    flex-wrap: wrap;

    &__items {
      display: flex;
      justify-content: space-between;
      align-items: center;
      padding: 16px;
      margin-bottom: 16px;
      width: 100%;
      font-weight: 500;
      font-size: 16px;
      line-height: 1;
      border-bottom: 1px solid #E5E5E5;
      box-shadow: 0px 1px 2px 0px #1018280D;
      transition: all .3s;

      &:hover {
        box-shadow: 0px 2px 3px 1px rgb(16 24 40 / 13%);
      }

      a {
        color: #6366F1;
        text-decoration: none;
      }
    }
  }

  .modal-wrapper {
    border-radius: 6px;
    height: 700px;
    overflow-y: scroll;
    background-color: #FAFAFA;

    h3 {
      font-weight: 800;
      font-size: 36px;
      padding-bottom: 32px;
    }

    @media (max-width: 991px) {
      border-radius: 0;
      height: 90vh;
      padding-top: 30px;
      padding-bottom: 30px;

      h3 {
        font-size: 30px;
      }

      a {
        word-break: break-all;
        padding-right: 20px;
        text-align: left;
        width: 80%;
      }
    }
  }
</style>
