<script lang="ts" setup>
const data = {
  title: 'Техническое обслуживание лифтов',
  text: 'Наши сотрудники обеспечат надлежащее состояние лифтовой шахты и подъемного оборудования, а проведение обслуживания ваших лифтов в соответствии со сроками регламента и постоянный контроль всех составляющих оборудования обеспечат бесперебойную работу и продление срока службы лифтов.',
  slides: ['uslugi-slider-1.png', 'uslugi-slider-2.png']
}
</script>

<template>
  <UslugiWrapper
      :data="data"
  />
</template>
