<script lang="ts" setup>
const data = {
  title: 'Наладка электронного оборудования подъемных устройств',
  text: 'Для корректной работы подъемных сооружений, инженеры и техники службы наладки проведут необходимое считывание, обработку, загрузку и установку данных, в случае необходимости, подберут необходимое электронное оборудование, произведут его замену, настроят, выставят нужные параметры работы лифтов, эскалаторов, подъёмных платформ, проверят точность работы внесенных изменений и оборудования в целом',
  slides: ['uslugi-slider-2.png', 'uslugi-slider-1.png']
}
</script>

<template>
  <UslugiWrapper
      :data="data"
  />
</template>
