<script lang="ts" setup>
const data = {
  title: 'Техническое обслуживание эскалаторов',
  text: 'Регулярная проверка нашими специалистами состояния всех звеньев, элементов, внешних и внутренних механизмов эскалаторов,  качественное и своевременное техническое обслуживание нашими профессионалами - вот что нужно для надежной и безопасной работы ваших эскалаторов.',
  slides: ['uslugi-slider-2.png', 'uslugi-slider-1.png']
}
</script>

<template>
  <UslugiWrapper
      :data="data"
  />
</template>
