<script lang="ts" setup>
const data = {
  title: 'Техническое обслуживание платформ подъемных',
  text: 'Опыт и профессионализм нашего персонала и строгое выполнение всех требований эксплуатационной документации завода-изготовителя позволяют нам обеспечивать высокую работоспособность любых видов и типов подъемных платформ (грузовых, гидравлических, инвалидных, столовых и т.п.)',
  slides: ['uslugi-slider-1.png', 'uslugi-slider-2.png']
}
</script>

<template>
  <UslugiWrapper
      :data="data"
  />
</template>
